<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">

<html lang="fr">

  <head>

  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  <meta http-equiv="Content-Language" content="fr">
  <meta http-equiv="Content-Style-Type" content="text/css">

    <title>Lettre technique (fran&ccedil;ais)</title>
    <link rel="stylesheet" type="text/css" href="letter-en.css">

  </head>

  <body>
    <div id="letter">
      Cher(e) Webmestre,

      <p>Votre site <span class="customize">ADAPTEZ: ins&eacute;rer l'URL
      ici</span> ne supporte pas le navigateur Firefox 2 ainsi que d'autres
      navigateurs bas&eacute;s sur le moteur de rendu Gecko tels que Camino 1,
      Seamonkey 1, Epiphany 2, Galeon 2 et K-meleon 1.</p>

      <p>Un rapport concernant ce probl&egrave;me existe dans le syst&egrave;me
      de bogues de mozilla.org. Vous pouvez consulter et ajouter des
      commentaires:<br>
      https://bugzilla.mozilla.org/show_bug.cgi?id=<span class="customize">
      ADAPTEZ: introduire le num&eacute;ro du bug ici</span></p>

      <p class="customize">ADAPTEZ: Introduisez une description technique
      des probl&egrave;mes, ainsi que des recommendations quant &agrave; la
      r&eacute;solution de ceux-ci. Vous pouvez &eacute;galement y attacher
      des exemples fonctionnels montrant comment le code du site peut
      &ecirc;tre modifi&eacute; pour supporter les standards et Mozilla.</p>

      <p>En suivant les recommendations ECMA pour ECMAScript (JavaScript)
      et les recommendations du W3C pour HTML 4.01, CSS 2.1 et DOM
      (Document Object Model) pour votre contenu, votre site fonctionnera dans
      ces navigateurs de derni&egrave;re g&eacute;n&eacute;ration ainsi que
      dans d'autres navigateurs qui supportent ces standards ouverts tel
      Opera 9, Safari 2 et Internet Explorer 7.</p>

      <p>Les sources suivantes vous aideront &agrave; supporter les standards
      ouverts tout en vous permettant de garder votre site fonctionnel dans
      Internet Explorer de Microsoft. Les informations
      sur la d&eacute;tection des navigateurs bas&eacute;s sur Gecko
      sont &eacute;galement importantes.</p>

      <p>ECMAScript 262 3&egrave;me Edition (JavaScript)<br>
       ----------------------------------------<br>
       http://www.ecma-international.org/publications/standards/Ecma-262.htm
       </p>

      <p>Recommandations et Techniques du World Wide Web Consortium (W3C)<br>
         ----------------------------------------------------------------<br>
       Le W3C d&eacute;finit les standards ouverts du World Wide Web, standards
       utilis&eacute;s par Firefox 2.<br>
       http://www.w3.org/TR/</p>
       <p>Certains de ces documents ont &eacute;t&eacute; traduits en fran&ccedil;ais:<br>
       http://www.w3.org/2005/11/Translations/Lists/ListLang-fr.html </p>

      <p>Mozilla Developer Center: Documentation pour d&eacute;veloppeur Web<br>
         -------------------------------------------------------------------<br>
       Visitez le site Mozilla Developer Center pour d&eacute;veloppeur Web pour trouver
       des informations sp&eacute;cifiques sur le support de Firefox 2 et des
       autres navigateurs bas&eacute;s sur le moteur de rendu Gecko.<br>
       http://developer.mozilla.org/fr/docs/Accueil </p>

      <p>Utilisation des standards du Web dans vos pages<br>
       -----------------------------------------------<br>
       Certains &eacute;l&eacute;ments et pratiques consid&eacute;r&eacute;s
       comme &quot;standard&quot; parmi les d&eacute;veloppeurs web pour
       le DHTML et/ou le support multi-navigateurs ne font plus partie des
       sp&eacute;cifications HTML 4.01 et Document Object Model du W3C.
       V&eacute;rifiez ce qui est support&eacute;.<br>
       http://developer.mozilla.org/en/docs/Using_Web_Standards_in_your_Web_Pages </p>

      <p>Le "Document Object Model" (DOM) dans Mozilla<br>
       ---------------------------------------------<br>
       http://www.mozilla.org/docs/dom/ :
       Contient des liens utiles pour l'apprentissage et l'utilisation
       du DOM dans Firefox et autres navigateurs bas&eacute;s sur Gecko.<br><br>

       http://developer.mozilla.org/fr/docs/R%C3%A9f%C3%A9rence_du_DOM_Gecko :
       La r&eacute;f&eacute;rence du DOM Gecko est un guide d'initiation
       &agrave; l'impl&eacute;mentation du W3C DOM dans Firefox et inclut de
       nombreux exemples.</p>

      <p>Mise &agrave; jour des pages Web DHTML<br>
       -------------------------------<br>
       Tout ce que vous devez savoir &agrave; propos de document.all et 
       autres extensions propri&eacute;taires et comment
       les utiliser dans un monde multi-navigateurs.<br>
       http://developer.mozilla.org/fr/docs/Standards_du_Web </p>

      <p>Aide possible dans un forum de discussion sur le d&eacute;veloppement Web<br>
         -------------------------------------------------------------------------<br>
       GeckoZone d&eacute;veloppement Web (forum de discussion)      
       http://www.geckozone.org/forum/viewforum.php?f=8

      <p>D&eacute;tection du navigateur et support multi-navigateurs<br>
       ----------------------------------------------------<br>
       Si vous d&eacute;sirez d&eacute;tecter les navigateurs utilisant Gecko, 
       le plus simple est de rechercher le terme &quot;Gecko&quot; dans la 
       cha&icirc;ne User Agent plut&ocirc;t qu'une marque sp&eacute;cifique 
       de navigateur ou une version particuli&egrave;re<br>
       Pour plus d'information:<br>
       http://developer.mozilla.org/en/docs/Browser_Detection_and_Cross_Browser_Support <br>
http://developer.mozilla.org/en/docs/Using_Web_Standards_in_your_Web_Pages#Developing_cross_browser.2Fcross_platform_pages
</p>

      <!--<p>Barres lat&eacute;rales de r&eacute;f&eacute;rence pour d&eacute;veloppeurs web<br>
       ___________________________________________________<br>
       DevEdge fournit des barres lat&eacute;rales (&quot;Sidebars&quot;) qui
       donnent aux utilisateurs de Mozilla et Netscape 7 un acc&egrave;s rapide
       aux standards du W3C : HTML 4.01, CSS2, CSS2.1 et le DOM.<br>
       http://devedge.netscape.com/toolbox/sidebars/</p>-->

      <p>D&eacute;bogueur JavaScript pour Firefox et Seamonkey<br>
       ---------------------------------------------<br>
       Venkman est un d&eacute;bogueur interactif et riche en
       fonctionnalit&eacute;s pour Firefox et Seamonkey. Il fonctionne sur
       toutes les plateformes pour lesquelles Firefox et Seamonkey sont disponibles.<br>
       Une introduction est disponible ici:<br>
       http://developer.mozilla.org/fr/docs/Venkman <br>
       http://www.svendtofte.com/code/learning_venkman/ </p>

      <p>Si vous avez des questions, n'h&eacute;sitez pas &agrave; me contacter.</p>

      <p class="customize">ADAPTEZ: Ins&eacute;rer votre signature ici.</p>
    </div>

  </body>
</html>