<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="author" content="Traduction : Matthieu Camus">
   <title>Broadcasters &amp; Observers</title>
</head>
<body>
<table BORDER=0 COLS=1 WIDTH="100%" >
<tr>
<td>
<div align=right><i>Manuel de r&eacute;f&eacute;rence du programmeur XUL</i></div>
</td>
</tr>

<tr>
<td>
<h1>
<font color="#000099"><font size=+2>&lt;<a href="broadcast.html">broadcaster</a>></font></font></h1>
</td>
</tr>

<tr>
<td>
<table BORDER=0 CELLSPACING=0 COLS=2 WIDTH="100%" BGCOLOR="#CCCCCC" >
<tr BGCOLOR="#000099">
<td><b><font color="#FFFFFF">Attributs</font></b></td>

<td><b><font color="#FFFFFF">Enfants communs</font></b></td>
</tr>

<tr>
<td><i><a href="common.html#id">id</a></i></td>

<td>&nbsp;* * *</td>
</tr>

<tr>
<td>action</td>

<td>&nbsp;</td>
</tr>

<tr>
<td>value</td>

<td>&nbsp;</td>
</tr>

<tr>
<td>oncommand</td>

<td>&nbsp;</td>
</tr>

<tr>
<td>&nbsp;</td>

<td>&nbsp;</td>
</tr>
</table>

<br>&nbsp;</td>
</tr>

<tr>
<td>
<h1>
<font color="#000099"><font size=+2>&lt;<a href="observe.html">observes</a>></font></font></h1>
</td>
</tr>

<tr>
<td>
<table BORDER=0 CELLSPACING=0 COLS=2 WIDTH="100%" BGCOLOR="#CCCCCC" >
<tr BGCOLOR="#000099">
<td><b><font color="#FFFFFF">Attributs</font></b></td>

<td><b><font color="#FFFFFF">Enfants communs</font></b></td>
</tr>

<tr>
<td><i><a href="common.html#id">id</a></i></td>

<td>&nbsp;* * *</td>
</tr>

<tr>
<td><a href="observe.html#element">element</a></td>

<td>&nbsp;</td>
</tr>

<tr>
<td><a href="observe.html#attribute">attribute</a></td>

<td>&nbsp;</td>
</tr>

<tr>
<td>mapto</td>

<td>&nbsp;</td>
</tr>

<tr>
<td>event</td>

<td>&nbsp;</td>
</tr>

<tr>
<td>&nbsp;</td>

<td>&nbsp;</td>
</tr>
</table>
</td>
</tr>

<tr>
<td>
<br>Les animateurs (broadcasters) et les observateurs (observers) forment un
m&eacute;canisme pour un nombre d'&eacute;l&eacute;ments qui sont avertis de
l'information d'&eacute;tat et
d'&eacute;v&eacute;nement &agrave; partir d'un simple &eacute;l&eacute;ment d'annonce. Quand un attribut sur un
broadcaster change, le broadcaster annonce ce changement d'&eacute;tat aux observers
int&eacute;ress&eacute;s -- qui indiquent qu'ils sont int&eacute;ress&eacute;s uniquement en identifiant le
broadcaster appropri&eacute;
(ex,  &lt;observes element="<i>l'id de celui qui m'int&eacute;resse</i>">).

<p>Ce m&eacute;canisme est utile pour pr&eacute;server l'uniformit&eacute; des diff&eacute;rents &eacute;l&eacute;ments de
l'IU (tels que la commande Cut dans un menu de contexte, le
bouton Cut toolbar et la commande Cut du menu d'&eacute;dition) quand ils
accomplissent les m&ecirc;mes tâches. Le rapport broadcaster/observer est flexible
et puissant. Les sections suivantes fournissent des exemples de diff&eacute;rentes
mani&egrave;res dont ce rapport peut &ecirc;tre exprim&eacute; en XUL. 

<h3>Simples Observers</h3>
<p>Les broadcasters sont en g&eacute;n&eacute;ral des &eacute;l&eacute;ments invisibles, bien qu'ils
n'aient pas besoin de l'&ecirc;tre. N'importe quel &eacute;l&eacute;ment peut &ecirc;tre un broadcaster
ou un observer et le rapport broadcaster/observer peut exister entre deux
&eacute;l&eacute;ments quelconques. Quand un &eacute;l&eacute;ment qui n'est pas explicitement un
broadcaster annonce l'information, les &eacute;l&eacute;ments observers observent en nommant
l'&eacute;l&eacute;ment d'annonce avec l'attribut <b>element</b>. L'exemple suivant montre
cette sorte de rapport broadcaster/observer, la moins utilis&eacute;e, 
qui est celui entre deux &eacute;l&eacute;ments r&eacute;guliers: 
<blockquote>
<table BORDER=0 WIDTH="60%" BGCOLOR="#D0D0D0" >
<tr>
<td>
<pre>
&lt;menuitem name="cut" />
&nbsp;
&lt;titledbutton value="Cut">
&nbsp; &lt;observes element="cut" attribute="disabled"/>
&lt;/titledbutton>
...</pre>
</td>
</tr>
</table>
</blockquote>
<h3>Broadcaster un-vers-plusieurs</h3>
<p>Bien que ce soit un choix simple de tirer profit du broadcasting, il est
inefficace parce qu'il met un "menuitem" normal dans une position d'annonce
sur un bouton, qui fait patie de l'IU. Un meilleur m&eacute;canisme est de d&eacute;finir un
"noeud" de broadcaster s&eacute;par&eacute;, auquel tous les &eacute;l&eacute;ments visibles de l'IU pr&ecirc;tent
attention. De cette fa&ccedil;on, l'&eacute;tat du noeud peut &ecirc;tre mis &agrave; jour dans un
endroit simple et facilement remarquable.</p>
<blockquote>
<table BORDER=0 WIDTH="60%" BGCOLOR="#D0D0D0">
<tr><td><pre>&lt;broadcaster id="cut"/>
 ...
&lt;menuitem name="Cut">
 &lt;observes element="cut" attribute="disabled"/>
&lt;/menuitem>
 ...
&lt;titledbutton value="Cut">
 &lt;observes element="cut" attribute="disabled"/>
&lt;/titledbutton>
 ... 
</pre>
</td></tr></table>
</blockquote>
<h3>Commande Noeud et attribut <b>observes</b></h3>
<p>Dans l'exemple pr&eacute;c&eacute;dent, l'item de menu et le bouton de titre prennent l'attribut <b>disabled</b> du noeud de
broadcaster. Le noeud de broadcaster poss&egrave;de des attributs qui peuvent &ecirc;tre observ&eacute;s par d'autres
&eacute;l&eacute;ments. Quand vous voulez annoncer tous les attributs d'un noeud, vous pouvez &eacute;galement utiliser une
construction l&eacute;g&egrave;rement diff&eacute;rente. Regardez l'exemple suivant: 
<blockquote>
<table BORDER=0 WIDTH="60%" BGCOLOR="#D0D0D0">
<tr><td><pre>
&lt;command id="cutCommand" 
  oncommand="specialCut()" 
  value="Cut Me!"
  disabled="false" />

&lt;menuitem <b>observes</b>="cutCommand"/> 
&lt;titledbutton <b>observes</b>="cutCommand"/> 
&lt;key <b>observes</b>="cutCommand"/>  
... 
</pre>
</td></tr></table>
</blockquote>
<p>Dans cette construction, le broadcaster est un <i>noeud de commande</i>,
dont la responsabilit&eacute; est d'annoncer la fonctionnalit&eacute; de la commande &agrave; tous
les &eacute;l&eacute;ments qui l'observent. L'acc&egrave;s &agrave; la commande specialCut() est
centralis&eacute; dans un endroit simple. D'une certaine mani&egrave;re, il est &eacute;galement
prot&eacute;g&eacute; par l'attribut disabled, qui contr&ocirc;le si un des noeuds observants
peut utiliser la commande ou pas et si sa propre IU refl&egrave;te la
disponibilit&eacute; de la commande ou pas. Un &eacute;l&eacute;ment d'IU observant le broadcaster
<b>cutCommand</b> est automatiquement invalid&eacute; en raison de la mani&egrave;re dont
les observers prennent les attributs des broadcasters dans ce deuxi&egrave;me type de
rapport broadcaster/observer. Dans tous les cas o&ugrave; l'&eacute;l&eacute;ment
d'IU inclut un attribut de valeur <b>value</b> qui indique ce qui est
r&eacute;ellement affich&eacute;, l'attribut de la valeur <b>value</b> du broadcaster est
&eacute;galement utilis&eacute;. 
<h3>Autres attributs Observer</h3>
<p>&nbsp;

</td>
</tr>
</table>
<br>&nbsp;
<div align=right>
<p><i>Last updated: 2/21/00 <a href="mailto:oeschger@netscape.com">Ian
Oeschger</a></i><br>
<i>French version (6/28/00) <a
href="mailto:matthieu.camus@univ-lemans.fr">Matthieu Camus</a></i>
</div>

</body>
</html>
