<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="Ian Oeschger / Traduction : Matthieu Camus">
   <title>XUL Reference Introduction</title>
</head>
<body>
<table BORDER=0 COLS=1 WIDTH="100%" >
<tr><td BGCOLOR="#CCCCCC"><p align="right"><i><b>Manuel de r&eacute;f&eacute;rence du programmeur XUL</b><br>
<b><font size=+1 color="red">Third Draft&nbsp;&nbsp;&nbsp;</font></b><br>
<a href="javascript:parent.location='http://bugzilla.mozilla.org/show_bug.cgi?id=24689'">Soumettre</a> commentaires et remarques</i></br>
<a href="http://www.mozilla.org/xpfe/Xulref.zip">Fichier zip</a><img
align="absmiddle" src="new01.gif" /> version HTML de cette doc </td></tr>
<tr>
<td>
<h1>
<font color="#000099"><font size=+2>Introduction</font></font></h1>

<blockquote><font color="#000099"><a href="#about">A propos de ce Document</a></font>
<br><font color="#000099"><a href="#widget">Widget : vue d'ensemble</a></font>
<br><font color="#000099"><a href="#attr">Information de r&eacute;f&eacute;rence</a></font>
<br><font color="#000099"><a href="#syntax">Syntaxe XUL</a></font>
<br><font color="#000099"><a href="#window">Organisation des interfaces XUL</a></font></blockquote>
</td>
</tr>

<tr>
<td BGCOLOR="#000099"><a NAME="about"></a><font color="#FFFFFF"><font size=+1>
A propos de ce Document</font></font></td>
</tr>

<tr>
<td>Ce document est une r&eacute;f&eacute;rence pour le langage XML-based User Interface
Language (XUL).  Comme les widgets d'interface que XUL d&eacute;crit, cette r&eacute;f&eacute;rence
est organis&eacute;e hi&eacute;rarchiquement. Par exemple, plusieurs des widgets h&eacute;ritent du
widget de cadre <a href="boxref.html">box</a>, ce qui signifie qu'ils
partagent les attributs d&eacute;crits dans cette zone de r&eacute;f&eacute;rence. L&agrave; o&ugrave;&nbsp;<a
NAME="attributesIDX"></a>des attributs sont &nbsp;<a
NAME="inheritedIDX"></a>h&eacute;rit&eacute;s, ces attributs sont imprim&eacute;s en italique dans
l'appel du widget. L'objet <a href="menubar.html">menubar</a> et les attributs 
qu'il h&eacute;rite du cadre en sont un bon exemple. 
<p>Une tr&egrave;s petite s&eacute;rie d'attributs est g&eacute;n&eacute;rale &agrave; tous les widgets mais non
h&eacute;rit&eacute;e des widgets ou outils g&eacute;n&eacute;ralis&eacute;s comme  &lt;box>. Celle-ci inclut des
attributs comme <a href="common.html#id">id</a>, avec lesquels chaque widget
XUL peut &ecirc;tre sp&eacute;cifi&eacute;s. Ces attributs sont
d&eacute;finis dans un fichier <a href="common.html">commun</a>. L&agrave; o&ugrave; des attributs
communs sont mis en application ou employ&eacute;s diff&eacute;remment par diff&eacute;rents widgets,
les attributs sont d&eacute;crits avec leurs widgets respectifs. Les valeurs pour
<b>class</b> changent compl&egrave;tement d'un widget &agrave; l'autre, par
exemple, une classe est d&eacute;finie s&eacute;par&eacute;ment pour chaque widget qui l'inclut. 
<p>Les sections suivantes forment une <i>tr&egrave;s br&egrave;ve</i> introduction &agrave;
XUL. Cette introduction est simplement destin&eacute;e comme pr&eacute;face &agrave;
l'information de r&eacute;f&eacute;rence XUL que ce document contient. Pour une information
plus d&eacute;taill&eacute;e, voir le <i>guide du programmeur XUL</i>. 
<br>&nbsp;</td>
</tr>

<tr>
<td BGCOLOR="#000099"><a NAME="widget"></a><font color="#FFFFFF"><font
 size=+1>Widget: vue d'ensemble</font></font></td>
</tr>

<tr>
<td>L'&eacute;l&eacute;ment racine dans un fichier XUL et le niveau sup&eacute;rieur de l'interface
qu'il d&eacute;finit est l'&eacute;l&eacute;ment &lt;<a href="windowref.html">window</a>>. Tous les fichiers
XUL doivent contenir un et un seul &eacute;l&eacute;ment window. L'interface enti&egrave;re XUL est
d&eacute;finie dans cet &eacute;l&eacute;ment racine. 
<p>Typiquement, une interface XUL se compose d'une certaine combinaison de
barres de menu et barres d'outils et d'une zone de contenu. Un
fichier typique XUL d&eacute;finissant une fen&ecirc;tre window tr&egrave;s simple
(mais trop simple pour &ecirc;tre techniquement valide) pourrait avoir pour structure de base
la structure suivante:
<blockquote>
<table BORDER=0 WIDTH="75%" BGCOLOR="#CCCCCC"> 
<tr><td><pre>&lt;window>
&nbsp; &lt;menubar>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &lt;menu value="File" />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &lt;menu value="Edit" />
&nbsp; &lt;/menubar>
&nbsp; &lt;box>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &lt;browser />
&nbsp; &lt;/box>
&lt;/window></pre>
</td></tr></table>
</blockquote>
Chacun des enfants &lt;window> (cad, menubar et box) peut lui-m&ecirc;me contenir
des &eacute;l&eacute;ments &nbsp;<a NAME="childIDX"></a>enfants. XUL pr&eacute;voit une
position et un embo&icirc;tement absolus des &eacute;l&eacute;ments. De cette fa&ccedil;on, l'interface
est ajout&eacute;e &agrave; la fen&ecirc;tre de base.
<p>Les diff&eacute;rents groupes de widget XUL sont:
<ul><a href="windowref.html">window</a>
<br><a href="boxref.html">box</a>
<br><a href="menuref.html">menus and menubars</a>
<br><a href="toolref.html">toolboxes and toolbars</a>
<br><a href="tabref.html">tab widget</a>
<br><a href="checkbox.html">checkbox</a>
<br><a href="buttonref.html">titled buttons</a>
<br><a href="scrollbar.html">scrollbar</a>
<br>splitter
<br><a href="progressmeter.html">progressmeter</a>
<br>&nbsp;
<br>&nbsp;</ul>
</td>
</tr>

<tr>
<td BGCOLOR="#000099"><a NAME="attr"></a><font color="#FFFFFF"><font size=+1>
Information de r&eacute;f&eacute;rence</font></font></td>
</tr>

<tr>
<td>Ce qui rend le tron&ccedil;on de l'exemple XUL de la section pr&eacute;c&eacute;dente 
presqu'inutile est le manque de d&eacute;tail. Le widget de cadre box, par
exemple, devrait &ecirc;tre plac&eacute; et identifi&eacute;, la fen&ecirc;tre elle-m&ecirc;me devrait 
avoir un titre et divers auditeurs d'&eacute;v&eacute;nement et ainsi de
suite. Pour la plupart des &eacute;l&eacute;ments, ce tri de fonctionnalit&eacute; est indiqu&eacute; avec 
des attributs de widgets dans le XPToolkit. Certains des attributs, tels
que l'attribut du <a href="boxref.html#flex">flex</a> de box sont facultatifs, et sont utilis&eacute;s 
pour pr&eacute;senter les widgets dans l'interface; d'autres attributs, tels que la
valeur des items  de menu ou des d&eacute;clarations de nom d'environnement namespace
pour l'&eacute;l&eacute;ment de la fen&ecirc;tre window elle-m&ecirc;me sont exig&eacute;s et cassent l'interface s'ils
n'apparaissent pas. Ce document d&eacute;crit tous les attributs et valeurs 
que supportent les widgets du XPToolkit, comme la hi&eacute;rarchie et la
structure des documents XUL valides. Ces deux principales cat&eacute;gories 
d'information apparaissent respectivement en tant qu'<i>Attributs</i> et <i>Enfants
communs</i> pour chaque widget XUL.
<br>&nbsp;
<br>&nbsp;</td>
</tr>

<tr>
<td BGCOLOR="#000099"><a NAME="syntax"></a><font color="#FFFFFF"><font size=+1>XUL
Syntaxe</font></font></td>
</tr>

<tr>
<td>XUL est un langage de d&eacute;finition d'interface bas&eacute; sur XML. Il y a deux &eacute;carts
tr&egrave;s l&eacute;gers &agrave; la syntaxe du noyau XML, mais pour la plupart, les r&egrave;gles de
syntaxe sont identiques. Les quatre r&egrave;gles cardinales de syntaxe XUL sont les suivantes: 
<ul>
<li>
Tous les &eacute;v&eacute;nements et attributs doivent &ecirc;tre &eacute;crits en minuscules</li>

<li>
Toutes les cha&icirc;nes de caract&egrave;res doivent &ecirc;tre doublement cit&eacute;es</li>

<li>
Chaque widget XUL doit employer des &eacute;tiquettes (comme &lt;tag>&lt;/tag> ou
&lt;tag/>) pour &ecirc;tre bien form&eacute;</li>

<li>
Tous les attributs doivent avoir une valeur&nbsp;</li>
</ul>
Notez que XUL ne pardonne pas au sujet des probl&egrave;mes de syntaxe et de typo. 
La majeure partie du temps, un fichier XUL ne s'affichera pas du tout si tel
ou tel autre &eacute;l&eacute;ment a &eacute;t&eacute; incorrectement &eacute;crit. Ignorez ces r&egrave;gles cardinales 
&agrave; vos risques et p&eacute;rils! 
<br>&nbsp;
<br>&nbsp;</td>
</tr>

<tr>
<td BGCOLOR="#000099"><a NAME="window"></a><font color="#FFFFFF"><font size=+1>
Organisation des interfaces XUL</font></font></td>
</tr>

<tr>
<td>Il y a un certain nombre de fichiers suppl&eacute;mentaires qui travaillent 
avec le fichier XUL pour cr&eacute;er une fen&ecirc;tre simple. Collectivement,
ces fichiers sont d&eacute;sign&eacute;s sous le nom de module et incluent des choses telles
que la feuille de style XUL, une DTD de cha&icirc;nes de
caract&egrave;res locales dans l'interface
et d'autres &eacute;l&eacute;ments XUL suppl&eacute;mentaire qui peut recouvrir le fichier XUL de base.
Les &eacute;l&eacute;ments de menu et autres commandes &eacute;mises dans un fichier XUL 
peuvent afficher d'autres fichiers XUL. Par exemple, la commande de
signets d'&eacute;dition <b>Edit Bookmarks</b> appel&eacute;e &agrave; partir du fichier de navigator.xul 
apporte la fen&ecirc;tre de signets de la m&ecirc;me mani&egrave;re que la
combinaison principale Ctrl + B. De cette fa&ccedil;on, l'interface est 
pr&eacute;sent&eacute;e par fichier.&nbsp;
<br>&nbsp;
<br>&nbsp;<p align="right"><i>Last updated: 3/21/00 <a
href="mailto:oeschger@netscape.com">Ian Oeschger</a></i><br>
<i>French version (7/3/00) <a
href="mailto:matthieu.camus@univ-lemans.fr">Matthieu Camus</a></i>
</p>
</td>
</tr>
</table>

</body>
</html>
